Repository: fmidev/weather-app
Catalog: ios/Widget/Localizable.xcstrings
Source language: en
Languages: fi, sv

source: at
fi: klo
sv: kl.

source: at %@
fi: klo %@
sv: kl. %@

source: Cold warning
fi: Pakkasvaroitus
sv: Varning för köld

source: Could not get location information
fi: Paikannus epäonnistui
sv: Positionering misslyckades

source: Displays the forecast for the next hour or the coming hours. Press and hold the widget to edit settings.
fi: Näyttää ennusteen seuraavalle tai seuraaville tunneille. Paina widgettiä pitkään muokataksesi asetuksia.
sv: Visar prognosen för nästa timme eller de kommande timmarna. Tryck och håll ned widgeten för att redigera inställningarna.

# E
source: East wind
fi: Itätuulta
sv: Östlig wind

source: Error loading forecast data
fi: Tapahtui virhe ladattaessa säätietoja
sv: Misslyckades med att ladda väderdata

source: Failed to load alerts
fi: Varoitusten lataus epäonnistui
sv: Misslyckades med att ladda varningar

source: Failed to load weather data
fi: Säätietojen lataus epäonnistui
sv: Misslyckades med att ladda väderdata

source: feels like **%@**
fi: tuntuu kuin **%@**
sv: känns som **%@**

source: Flood warning
fi: Tulvavaroitus
sv: Varning för översvämning

source: Forecast
fi: Ennuste
sv: Prognos

source: Forest fire warning
fi: Maastopalovaroitus
sv: Varning för terrängbrand

source: Grass fire warning
fi: Ruohikkopalovaara
sv: Risk för gräsbrand

source: Heat wave warning
fi: Hellevaroitus
sv: Varning för värmebölja

source: Heavy rain warning
fi: Sadevaroitus
sv: Nederbördsvarning

source: Ice accretion warning
fi: Jäätämisvaroitus
sv: Varning för nedisning av fartyg

source: Location failed
fi: Paikannus epäonnistui
sv: Platsbestämning misslyckades

source: Location services are not allowed. Please enable them in the settings.
fi: Paikannusta ei ole sallittu. Salli paikannus asetuksista.
sv: Platstjänster är inte tillåtna. Aktivera dem i inställningarna.

# N
source: North wind
fi: Pohjoistuulta
sv: Nordlig vind

# NE
source: Northeast wind
fi: Koillistuulta
sv: Nordostlig vind

source: Next hour forecast
fi: Seuraavan tunnin ennuste
sv: Nästa timmes prognos

source: No warnings
fi: Ei varoituksia
sv: Inga varningar

# NW
source: Northwest wind
fi: Luoteistuulta
sv: Nordvästlig vind

source: Pedestrian weather warning
fi: Jalankulkusää
sv: Fotgängarvädret

source: Retrying location services automatically.
fi: Paikannusta yritetään uudestaan automaattisesti.
sv: Platstjänster försöks automatiskt på nytt

# S
source: South wind
fi: Etelätuulta
sv: Sydlig vind

# SE
source: Southeast wind
fi: Kaakkoistuulta
sv: Sydostlig vind

# SW
source: Southwest wind
fi: Lounaistuulta
sv: Sydvästlig vind

# symbol-1
source: Clear
fi: Selkeää
sv: Klart

# symbol-2
source: Mostly clear
fi: Enimmäkseen selkeää
sv: Mest klart

# symbol-4
source: Partly cloudy
fi: Puolipilvistä
sv: Halvklart

# symbol-6
source: Mostly cloudy
fi: Enimmäkseen pilvistä
sv: Molnigt

# symbol-7
source: Overcast
fi: Pilvistä
sv: Mulet

# symbol-9
source: Fog
fi: Sumua
sv: Dimma

# symbol-11
source: Drizzle
fi: Tihkusadetta
sv: Duggregn

# symbol-14
source: Freezing drizzle
fi: Jäätävää tihkua
sv: Underkylt duggregn

# symbol-17
source: Freezing rain
fi: Jäätävää sadetta
sv: Underkylt regn

# symbol-21
source: Isolated showers
fi: Yksittäisiä sadekuuroja
sv: Enstaka regnskurar

# symbol-24
source: Scattered showers
fi: Paikoin sadekuuroja
sv: Lokalt regnskurar

# symbol-27
source: Showers
fi: Paikoin sadekuuroja
sv: Lokalt regnskurar

# symbol-31
source: Partly cloudy and periods of light rain
fi: Puolipilvistä ja ajoittain heikkoa vesisadetta
sv: Halvklart och tidvis lätt regn

# symbol-32
source: Partly cloudy and periods of moderate rain
fi: Puolipilvistä ja ajoittain kohtalaista vesisadetta
sv: Halvklart och tidvis måttligt regn

# symbol-33
source: Partly cloudy and periods of heavy rain
fi: Puolipilvistä ja ajoittain voimakasta vesisadetta
sv: Halvklart och tidvis kraftigt regn

# symbol-34
source: Mostly cloudy and periods of light rain
fi: Enimmäkseen pilvistä ja ajoittain heikkoa vesisadetta
sv: Molnigt och tidvis lätt regn

# symbol-35
source: Mostly cloudy and periods of moderate rain
fi: Enimmäkseen pilvistä ja ajoittain kohtalaista vesisadetta
sv: Molnigt och tidvis måttligt regn

# symbol-36
source: Mostly cloudy and periods of heavy rain
fi: Enimmäkseen pilvistä ja ajoittain voimakasta vesisadetta
sv: Molnigt och tidvis kraftigt regn

# symbol-37
source: Light rain
fi: Heikkoa vesisadetta
sv: Lätt regn

# symbol-38
source: Moderate rain
fi: Kohtalaista vesisadetta
sv: Måttligt regn

# symbol-39
source: Heavy rain
fi: Voimakasta vesisadetta
sv: Kraftigt regn

# symbol-41
source: Isolated light sleet showers
fi: Puolipilvistä ja ajoittain heikkoa räntäsadetta tai räntäkuuroja
sv: Halvklart och enstaka byar av lätt snöblandat regn

# symbol-42
source: Isolated moderate sleet showers
fi: Puolipilvistä ja ajoittain kohtalaista räntäsadetta tai räntäkuuroja
sv: Halvklart och enstaka byar av måttligt snöblandat regn

# symbol-43
source: Isolated heavy sleet showers
fi: Puolipilvistä ja ajoittain voimakasta räntäsadetta tai räntäkuuroja
sv: Halvklart och enstaka byar av kraftigt snöblandat regn

# symbol-44
source: Scattered light sleet showers
fi: Enimmäkseen pilvistä ja ajoittain heikkoa räntäsadetta tai räntäkuuroja
sv: Molnigt och spridda byar av lätt snöblandat regn

# symbol-45
source: Scattered moderate sleet showers
fi: Enimmäkseen pilvistä ja ajoittain kohtalaista räntäsadetta tai räntäkuuroja
sv: Molnigt och spridda byar av måttligt snöblandat regn

# symbol-46
source: Scattered heavy sleet showers
fi: Enimmäkseen pilvistä ja ajoittain voimakasta räntäsadetta tai räntäkuuroja
sv: Molnigt och spridda byar av lätt snöblandat regn

# symbol-47
source: Light sleet
fi: Heikkoa räntäsadetta
sv: Lätt snöblandat regn

# symbol-48
source: Moderate sleet
fi: Kohtalaista räntäsadetta
sv: Måttligt snöblandat regn

# symbol-49
source: Heavy sleet
fi: Voimakasta räntäsadetta
sv: Kraftigt snöblandat regn

# symbol-51
source: Isolated light snow showers
fi: Puolipilvistä ja ajoittain heikkoa lumisadetta tai lumikuuroja
sv: Halvklart och enstaka lätta snöbyar

# symbol-52
source: Isolated moderate snow showers
fi: Puolipilvistä ja ajoittain kohtalaista lumisadetta tai lumikuuroja
sv: Halvklart och enstaka måttliga snöbyar

# symbol-53
source: Isolated heavy snow showers
fi: Puolipilvistä ja ajoittain voimakasta lumisadetta tai lumikuuroja
sv: Halvklart och enstaka ymniga snöbyar

# symbol-54
source: Scattered light snow shower
fi: Enimmäkseen pilvistä ja ajoittain heikkoa lumisadetta tai lumikuuroja
sv: Molnigt och spridda lätta snöbyar

# symbol-55
source: Scattered moderate snow showers
fi: Enimmäkseen pilvistä ja ajoittain kohtalaista lumisadetta tai lumikuuroja
sv: Molnigt och spridda måttliga snöbyar

# symbol-56
source: Scattered heavy snow showers
fi: Enimmäkseen pilvistä ja ajoittain voimakasta lumisadetta tai lumikuuroja"
sv: Molnigt och spridda ymniga snöbyar

# symbol-57
source: Light snowfall
fi: Heikkoa lumisadetta
sv: Lätt snöfall

# symbol-58
source: Moderate snowfall
fi: Kohtalaista lumisadetta
sv: Måttligt snöfall

# symbol-59
source: Heavy snowfall
fi: Runsasta lumisadetta
sv: Måttligt snöfall

# symbol-61
source: Isolated hail showers
fi: Yksittäisiä raekuuroja
sv: Enstaka hagelskurar

# symbol-64
source: Scattered hail showers
fi: Paikoin raekuuroja
sv: Lokalt hagelskurar

# symbol-67
source: Hail showers
fi: Raekuuroja
sv: Lokalt hagelskurar

# symbol-71
source: Isolated thundershowers
fi: Yksittäisiä ukkoskuuroja
sv: Enstaka åskskurar

# symbol-74
source: Scattered thundershowers
fi: Paikoin ukkoskuuroja
sv: Lokalt åskskurar

# symbol-77
source: Thundershowers
fi: Ukkoskuuroja
sv: Åskskurar

source: The alerts are outdated
fi: Varoitukset ovat vanhentuneet
sv: Varningarna är inaktuella

source: The device is in airplane mode. Warnings will be updated once the internet connection is back.
fi: Laite on lentokonetilassa. Varoitukset päivitetään, kun internet-yhteys palautuu.
sv: Enheten är i flygplansläge. Varningarna uppdateras när internet är tillbaka.

source: The device is in airplane mode. Weather updates will refresh when the internet connection is back.
fi: Laite on lentokonetilassa. Säätiedot päivitetään, kun internet-yhteys palautuu.
sv: Enheten är i flygplansläge. Väderdata uppdateras när internet är tillbaka.

source: The weather information is outdated
fi: Säätiedot ovat vanhentuneet
sv: Väderinformationen är inaktuell

source: Unknown error
fi: Tuntematon virhe
sv: Okänt fel

source: Updated %@
fi: Päivitetty %@
sv: Uppdaterad %@

source: Updated at **%@**
fi: Päivitetty klo **%@**
sv: Päivitetty klo **%@**

# W
source: West wind
fi: Länsituulta
sv: Västlig vind

source: Warning for high sea level
fi: Varoitus korkeasta merivedest
sv: Varning för högt vattenstånd

source: Warning for low sea level
fi: Varoitus matalasta merivedestä
sv: Varning för lågt vattenstånd

source: Warnings (%lld)
fi: Varoituksia (%lld)
sv: Varningar (%lld)

source: Warnings are only available for the Finland region.
fi: Varoitukset ovat saatavilla vain Suomen alueella
sv: Varningar är endast tillgängliga i Finland.

source: Warnings will refresh when the internet connection is back.
fi: Varoitukset päivitetään, kun internet-yhteys palautuu.
sv: Varningarna uppdateras när internet är tillbaka.

source: Wave height warning
fi: Aallokkovaroitus
sv: Varning för hård sjögång

source: Weather data is too old
fi: Säätiedot ovat vanhentuneet
sv: Väderinformationen är inaktuell

source: Weather updates will refresh when the internet connection is back.
fi: Säätiedot päivitetään, kun internet yhteys palautuu.
sv: Vädredata uppdateras när internet är tillbaka

source: Weather warnings
fi: Säävaroitukset
sv: Vädervarningar

source: Weather warnings for today
fi: Säävaroitukset tänään
sv: Vädervarningar för idag

source: Weather warnings in your location. Press and hold the widget to edit settings.
fi: Säävaroitukset omaan sijaintiisi. Paina widgettiä pitkään muokataksesi asetuksia.
sv: Vädervarningar på din plats. Tryck och håll ned widgeten för att redigera inställningarna.

source: Wind warning for land areas
fi: Tuulivaroitus maa-alueille
sv: Vindvarning för landområden

source: Wind warning for sea areas
fi: Tuulivaroitus merelle
sv: Vindvarning för havsområden
